app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`username` = 'dummy') LIMIT 1
---
  def show
    @user = User.find_by_username(params[:id])